#include <stdio.h>

int main() {

    int sum, p, x, y;         // ประกาศตัวแปร
    sum = 0;                 // เริ่มต้นผลรวมที่ 0

    for (x = 1, y = 1; x * y <= 15; x++, y += 2) {   // วนลูปตั้งแต่ x = 1, y = 1 จนกว่า x * y > 15
        p = x * y;          //คำนวณผลคูณของ x และ y
        sum = sum + p;     // รวมผลคูณลงในตัวแปร sum

        printf("%d * %d = %d\n", x, y, p);    // แสดงค่าที่เปลี่ยนไปในแต่ละรอบ เช่น รอบที่ 1: 1 * 1 = 1
    }

    printf("Summation of x * y = %d\n", sum); // แสดงผลรวมทั้งหมดหลังจบลูป

    return 0;
}